tests/mutants/alloc-forgets-back.patch
An object does not record where the one before it lies,
so a destroy, which takes the objects newest first,
goes from the newest straight back to the descriptor and leaves the rest standing.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: object does not know where the one before it lies

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -156,7 +156,6 @@ void *pool_alloc(struct pool *pool, uint8_t type, size_t size)
     memset(obj, 0, aligned);
     obj->type = type;
     obj->pool = pool_base(pool);
-    obj->back = (uint16_t)((v2p(obj) - pool->last) / OBJ_ALIGN);
     pool->last = v2p(obj);
     return obj;
 }
