tests/mutants/bind-forgets-line-table.patch
A bind leaves the line table empty.
The interrupt would find no Irq to signal and the kernel would panic;
the line table records exactly the Irqs that are bound.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: irq is missing from the line table

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -522,7 +522,6 @@ static int op_irq_line(struct thread *t, uint32_t slot, const struct cap *cap,
         struct irq *irq = pool_alloc(pool, CAP_IRQ, sizeof(*irq));
         irq->ntfn = v2p(ntfn);
         irq->line = first;
-        line_irq[first] = v2p(irq);
         /* The line goes, a leaf now, and the Irq hangs below the pool capability as any object does. */
         cap_delete(slot_node(t, slot), false);
         /* Its bits are zero, so it is disarmed, and its line stays masked as every line does until a set. */
