tests/mutants/carve-ignores-grain.patch
A carve that ignores the grain hands out a region hardware would round;
the corpus has such carves and the 32-byte-grain build sees them.

diff --git a/kernel/syscall.c b/kernel/syscall.c
index caf6e35..230a76f 100644
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -79,7 +79,7 @@ static int op_region(struct thread *t, uint32_t slot, const struct cap *cap,
         uint32_t off = arg[1];
         uint32_t len = arg[2];
         /* On the grain, so that every region capability can be installed as it is. */
-        if (!grain_aligned(off, len) || len == 0 || off > size || len > size - off) {
+        if ((off | len) & 3u || len == 0 || off > size || len > size - off) {
             return KERR_INVALID_ARG;
         }
         struct cap sub = cap_to_region(base + off, len, cap->rights);
