tests/mutants/destroy-spares-living-process-table.patch
A destroy clears the table slot of a process only when the process dies with it.
A process whose table went with another pool keeps naming the freed table;
a process's table slot is empty or names a live table.

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -244,3 +244,5 @@
             struct process *proc = (struct process *)o;
-            sweep_node(&proc->table, dying, base, size);
+            if (dying) {
+                sweep_node(&proc->table, dying, base, size);
+            }
             for (unsigned i = 0; i < PROCESS_REGION_SLOTS; i++) {
