tests/mutants/install-walks-pools.patch
The install looks at every pool again for one its region would overlap,
a walk the table of "Bounded work" no longer lists.
No frame overlaps a pool, so the walk refuses nothing, and only the loop check catches it.

Caught-by: loop-bounds

diff --git a/kernel/process.c b/kernel/process.c
--- a/kernel/process.c
+++ b/kernel/process.c
@@ -58,6 +58,12 @@ int process_install(struct process *proc, unsigned slot,
      * No frame overlaps a pool, by the derivation tree: what one Untyped makes never overlaps,
      * so only the process's own regions are left to look at; see DESIGN.md, "Region slots".
      */
+    for (struct pool *p = pool_list; p != NULL; p = pool_next_pool(p)) {
+        LOOP_WALK(pool_overlaps);
+        if (ranges_overlap(base, size, pool_base(p), p->size)) {
+            return KERR_OVERLAP;
+        }
+    }
     unsigned installed = 0;
     for (unsigned i = 0; i < PROCESS_REGION_SLOTS; i++) {
         LOOP_BOUND(PROCESS_REGION_SLOTS);
