tests/mutants/bind-ignores-taken-line.patch
A line may be bound twice.
The interrupt would reach whichever Irq the walk finds first
and the other would stay armed on a line it never hears;
at most one Irq is bound to any line.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: irq is missing from the line table

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -502,9 +502,6 @@ static int op_irq_line(struct thread *t, uint32_t slot, const struct cap *cap,
         if (err != KERR_OK) {
             return err;
         }
-        if (line_binding(first) != NULL) {
-            return KERR_OVERLAP;
-        }
         /* The invoked slot is cleared below, so it may receive the Irq capability. */
         if (arg[3] != slot) {
             err = cap_slot_free(thread_table(t), arg[3]);
