tests/mutants/interrupt-walks-for-its-irq.patch
An interrupt looks for the pool of its Irq among every pool,
a walk the line table was there to spare it,
so a machine with many pools takes that long for every interrupt.
It finds the same Irq, so only the loop check catches it.

Caught-by: loop-bounds

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -282,7 +282,12 @@ paddr_t line_irq[LINES];
 
 struct irq *line_binding(uint32_t line)
 {
-    return line_irq[line] != 0 ? p2v(line_irq[line]) : NULL;
+    for (struct pool *p = pool_list; p != NULL && line_irq[line] != 0; p = pool_next_pool(p)) {
+        if (range_contains(pool_base(p), p->size, line_irq[line])) {
+            return p2v(line_irq[line]);
+        }
+    }
+    return NULL;
 }
 
 bool sched_forget(struct obj_header *o, bool preempt)
