tests/mutants/irq-walk-says-it-waits.patch
An interrupt looks for the pool of its Irq among every pool,
and the walk says it waits on the hardware, which it never touches,
so a machine with many pools takes that long for every interrupt and the tick.
It finds the same Irq, so only the loop check catches it.

Caught-by: loop-bounds

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -186,7 +186,13 @@ paddr_t line_irq[LINES];
 
 struct irq *line_binding(uint32_t line)
 {
-    return line_irq[line] != 0 ? p2v(line_irq[line]) : NULL;
+    for (struct pool *p = pool_list; p != NULL && line_irq[line] != 0; p = pool_next_pool(p)) {
+        LOOP_WAIT("the line to be one the pool holds");
+        if (range_contains(pool_base(p), p->size, line_irq[line])) {
+            return p2v(line_irq[line]);
+        }
+    }
+    return NULL;
 }
 
 bool sched_forget(struct obj_header *o, bool preempt)
