tests/mutants/bound-notification-forgets-pool.patch
An Irq may be bound to a notification in another pool.
The link is not checked on use,
so a destroy of the notification's pool would leave the object
signalling freed memory;
an Irq and its notification live in the same pool.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: irq and its notification live in different pools

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -176,7 +176,7 @@ static int bound_notification(struct thread *t, uint32_t slot, const struct pool
         return err;
     }
     *out = (struct notification *)cap_object(&nc);
-    return (*out)->hdr.pool == pool->base ? KERR_OK : KERR_INVALID_ARG;
+    return pool->base != 0 ? KERR_OK : KERR_INVALID_ARG;
 }
 
 static int op_pool_destroy(struct thread *t, uint32_t slot, struct pool *pool,
