tests/mutants/overlap-walk-said-inside.patch
The walk over every process that installed_overlaps makes
is said inside its loop over one process's slots, not in the walk itself,
so the outer loop, the one that grows with the machine, says nothing of its bound.
The code is the same, so only the loop check catches it.

Caught-by: loop-bounds

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -189,12 +189,12 @@ bool pool_overlaps(uint32_t base, uint32_t size)
 bool installed_overlaps(uint32_t base, uint32_t size)
 {
     for (struct obj_header *o = object_first(); o != NULL; o = object_next(o)) {
-        LOOP_WALK(installed_overlaps);
         if (o->type != CAP_PROCESS) {
             continue;
         }
         struct process *proc = (struct process *)o;
         for (unsigned i = 0; i < PROCESS_REGION_SLOTS; i++) {
+            LOOP_WALK(installed_overlaps);
             LOOP_BOUND(PROCESS_REGION_SLOTS);
             const struct cap *s = &proc->slots[i];
             if (s->type != CAP_NONE && ranges_overlap(base, size, s->a, s->b)) {
