tests/mutants/pool-zeroing-unsaid.patch
A retype zeroes the whole of a new pool again, work in its size,
and does not say so where it calls memset,
so a walk the table of "Bounded work" does not list hides behind a call.
Each object is still zeroed as it is allocated, so only the loop check catches it.

Caught-by: loop-bounds

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -225,6 +225,7 @@ static int op_untyped(struct thread *t, uint32_t slot, const struct cap *cap,
              * so the capability may go and the memory stays accounted for.
              * It is not zeroed here, which would be work in its size: pool_alloc zeroes each object.
              */
+            memset(p2v(at), 0, len);
             struct pool *pool = pool_create(at, len, u);
             c = cap_to_object(&pool->hdr, RIGHT_ALL);
             parent = &pool->node;
