tests/mutants/copy-takes-parent-rights.patch
A copy takes the rights of its source's parent instead of its source's.
It stands beside its source, below that parent, so the tree stays well formed,
yet a thread lent a narrowed capability widens it back to what the lender held.
Authority only flows, so the copy is covered by nothing its caller held.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: a call made a capability no capability of its caller covers
Report: frame with rights beyond the grant

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -68,8 +68,14 @@ static int op_captable(struct thread *t, const struct cap *cap,
         if (err != KERR_OK) {
             return err;
         }
-        src.rights &= (uint8_t)arg[3];
         struct cap *source = slot_node(t, arg[2]);
+        uint32_t link = source->next;
+        while (!(link & LINK_UP)) {
+            LOOP_BOUND(CAPTABLE_MAX_SLOTS);
+            link = ((struct cap *)p2v(link & ~LINK_UP))->next;
+        }
+        struct cap *up = link == LINK_UP ? NULL : p2v(link & ~LINK_UP);
+        src.rights = (uint8_t)((op == OP_CAP_COPY && up != NULL ? up->rights : src.rights) & arg[3]);
         /* A copy stands beside its source in the tree, a derivation below it. */
         if (op == OP_CAP_COPY) {
             /* A copy of an Untyped would be a second allocator over the same memory. */
