tests/mutants/copy-widens-rights.patch
A copy takes the rights the caller asks for
instead of narrowing the ones the source capability holds.
Rights only narrow through copies,
so a table ends up with a capability wider than the one it came from.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: a call made a capability no capability of its caller covers

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -68,7 +68,7 @@ static int op_captable(struct thread *t, const struct cap *cap,
         if (err != KERR_OK) {
             return err;
         }
-        src.rights &= (uint8_t)arg[3];
+        src.rights = (uint8_t)arg[3];
         struct cap *source = slot_node(t, arg[2]);
         /* A copy stands beside its source in the tree, a derivation below it. */
         if (op == OP_CAP_COPY) {
