tests/mutants/delete-forgets-adoption.patch
A delete that does not hand the node's children to its parent
leaves them linked up to an empty slot.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: link up to a slot that is not a live, filled one

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -150,7 +150,7 @@ static void clear_node(struct cap *n)
 static void detach(struct cap *n, bool adopt)
 {
     /* The children go right after n, so n leaves the ring as a leaf would. */
-    if (adopt && n->child != 0) {
+    if (adopt && 0 && n->child != 0) {
         splice_after(n, node(n->child), node(node(n->child)->prev));
     }
     struct cap *pred = node(n->prev);
