tests/mutants/selfcheck-untraced.patch
The self-check runs on every tick, traced or not,
so the one walk the loop check takes on trust is on the tick's path.
It checks the same, so only the loop check's guard on the cut catches it.

Caught-by: loop-bounds

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -287,6 +287,7 @@ void sched_run_next(void)
 
 void sched_tick(void)
 {
+    selfcheck_run();
     tick_advance();
     /* The running thread is ready, and goes to the back of the round behind any other that is. */
     if (run_queue != 0) {
