tests/mutants/delete-stops-before-its-step.patch
A delete below a root that asks for an interrupt before its first step
may stop having made no child a root,
and the call it stops starts again from where it began, as often as an interrupt is pending.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: a call was preempted before it took anything away

diff --git a/kernel/cap.c b/kernel/cap.c
index c22b037..6082c9f 100644
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -217,6 +217,9 @@ bool cap_delete(struct cap *n, bool preempt)
     /* Below a root there is no ring to hand the children to: each becomes a root, one step at a time. */
     while (n->child != 0) {
         LOOP_PAID(cap_delete, link, "a child below a root, which becomes a root itself");
+        if (stop_here(preempt)) {
+            return false;
+        }
         struct cap *c = node(n->child);
         detach(c, false);
         c->next = LINK_UP;
