tests/mutants/destroy-keeps-armed-timer.patch
A pool destroy forgets the armed Irqs it takes, a timer line's among them.
The stall in wfi would wait for a timer line that is gone;
the count of armed sources is exactly the Irqs armed on a device's line or a timer line.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: the count of armed sources is wrong

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -338,8 +338,6 @@ bool sched_forget(struct obj_header *o, bool preempt)
         break;
     }
     case CAP_IRQ: {
-        /* It is gone and will not fire, so it is no source. */
-        irq_set_bits((struct irq *)o, 0);
         /* The object that would receive the interrupt is gone; only the controller's lines have a mask. */
         uint32_t line = ((struct irq *)o)->line;
         if (line_on_controller(line)) {
