tests/mutants/destroy-keeps-waiters.patch
A destroy that leaves a thread blocked on a notification it took away.
The thread waits on an object that is no longer live.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: thread waits on something that is not a notification

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -313,7 +313,7 @@ bool sched_forget(struct obj_header *o, bool preempt)
          * The thread learns that the way every other call learns it.
          * Its progress is the queue: a stop leaves the rest waiting on a notification still whole.
          */
-        while (ntfn->waiters != 0) {
+        while (ntfn->waiters != 0 && o->type != CAP_NOTIFICATION) {
             LOOP_PAID(sched_forget, waiter, "a thread that waited, by a call of its own");
             struct thread *t = p2v(ntfn->waiters);
             unwait(t);
