tests/mutants/destroy-leaves-line-unmasked.patch
A pool destroy forgets the lines of the Irqs it takes.
The controller would go on forwarding a line to an object that is gone;
the controller forwards a line exactly while an Irq is armed on it.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: controller forwards a line nothing is armed on

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -342,9 +342,6 @@ bool sched_forget(struct obj_header *o, bool preempt)
         irq_set_bits((struct irq *)o, 0);
         /* The object that would receive the interrupt is gone; only the controller's lines have a mask. */
         uint32_t line = ((struct irq *)o)->line;
-        if (line_on_controller(line)) {
-            irq_enable(line, false);
-        }
         line_irq[line] = 0;
         break;
     }
