tests/mutants/destroy-leaves-link-into-freed-memory.patch
A destroy that revokes only the capabilities naming its objects
leaves the slots of the dying tables in the rings of slots that survive,
and those rings then lead into memory that is user memory again.

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -230,7 +230,7 @@
                     continue;
                 }
                 /* A node the range holds takes what was derived from it: a grant dies with its slot. */
-                if (dying || (cap_has_object(c->type) && range_contains(base, size, c->a))) {
+                if ((cap_has_object(c->type) && range_contains(base, size, c->a))) {
                     cap_revoke(c);
                 }
             }
