tests/mutants/destroy-leaves-thread-queued.patch
A destroy zeroes a waiting thread but leaves it on a notification that survives.
The ring would lead into memory that is no longer a thread;
a notification queues only live threads.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: queue holds something that is not a thread
Report: queue is not linked back

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -218,9 +218,7 @@ bool sched_forget(struct obj_header *o, bool preempt)
          * A ready one is not running, since the caller does not live here, so it is queued.
          */
         struct thread *t = (struct thread *)o;
-        if (t->state == THREAD_WAITING) {
-            unwait(t);
-        } else if (t->state == THREAD_READY) {
+        if (t->state == THREAD_READY) {
             ring_remove(&run_queue, t);
         }
         break;
