tests/mutants/destroy-leaves-thread-ready.patch
A destroy zeroes a ready thread but leaves it on the run queue.
The next switch would run memory that is no longer a thread;
the run queue holds only live threads.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: queue holds something that is not a thread

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -216,8 +216,6 @@ void sched_forget(struct obj_header *o)
         struct thread *t = (struct thread *)o;
         if (t->state == THREAD_WAITING) {
             unwait(t);
-        } else if (t->state == THREAD_READY) {
-            ring_remove(&run_queue, t);
         }
         break;
     }
