tests/mutants/destroy-spares-dying-process-table.patch
A destroy clears the region slots of a dying process but not its table slot,
which stays in the ring of the capability its table was made with
and then links into freed memory.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: child link to a slot that is not a live, filled one

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -55,6 +55,9 @@ static struct cap *held_node(struct obj_header *o, uint16_t *at)
 {
     uint32_t count;
     struct cap *slots = obj_nodes(o, &count);
+    if (o->type == CAP_PROCESS && *at == 0) {
+        *at = 1;
+    }
     for (; *at < count; (*at)++) {
         LOOP_BOUND(CAPTABLE_MAX_SLOTS);
         if (slots[*at].type != CAP_NONE) {
