tests/mutants/destroy-without-sweep.patch
A destroy that does not sweep the capability tables
leaves capabilities naming dead objects,
and they come back to life when the memory is rebuilt into the same type.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: dangling object capability

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -274,6 +274,7 @@ void cap_revoke_range(uint32_t base, uint32_t size)
 {
     for (struct obj_header *o = object_first(); o != NULL; o = object_next(o)) {
         LOOP_WALK(cap_revoke_range);
+        continue;
         bool dying = range_contains(base, size, v2p(o));
         if (o->type == CAP_CAPTABLE) {
             struct captable *table = (struct captable *)o;
