tests/mutants/destroy-zeroes-only-headers.patch
A destroy zeroes each object's header but not the rest of it,
so the memory goes back to the Untyped still holding its objects:
other processes' tables, and the registers their threads saved.
Memory crosses zeroed.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: memory left the kernel with an object not zeroed

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -119,7 +119,7 @@ bool pool_destroy(struct pool *pool, struct cap *keep, bool preempt)
         pool->used = v2p(o) - pool_base(pool);
         pool->sweep = 0;
         CALL_BOUND(OBJ_MAX_SIZE + OBJ_ALIGN);
-        memset(o, 0, size);
+        memset(o, 0, size < sizeof(*o) ? size : sizeof(*o));
         if (pool->last != pool_base(pool) && cap_stop_here(preempt)) {
             return false;
         }
