tests/mutants/destroy-zeroes-only-headers.patch
A destroy zeroes each object's header but not the rest of it,
so the memory goes back to user mode still holding its objects:
other processes' tables, and the registers their threads saved.
Memory crosses zeroed.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: memory left the kernel with an object not zeroed

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -52,3 +52,3 @@ static void pool_clear(struct pool *pool)
         CALL_BOUND(OBJ_MAX_SIZE);
-        memset(o, 0, obj_size(o));
+        memset(o, 0, sizeof(*o));
     }
