tests/mutants/detach-forgets-successor.patch
A node taken out of a ring without relinking its successor's predecessor
leaves that link on an empty slot.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: predecessor link to a slot that is not a live, filled one

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -152,7 +152,6 @@ static void detach(struct cap *n, bool adopt)
         splice_after(n, node(n->child), node(node(n->child)->prev));
     }
     struct cap *pred = node(n->prev);
-    ring_next(n)->prev = n->prev;
     /* n is first exactly when its predecessor links up: it is the last child then, or n itself. */
     if (pred->next & LINK_UP) {
         node(pred->next)->child = (n->next & LINK_UP) ? 0 : n->next;
