tests/mutants/fire-keeps-armed-count.patch
An Irq that fires disarms behind the count's back.
The stall in wfi would go on waiting for a line that will never fire;
the count of armed sources is exactly the Irqs armed on a device's line or a timer line.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: the count of armed sources is wrong

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -127,7 +127,7 @@ void sched_signal(struct notification *ntfn, uint32_t bits)
 void irq_signal(struct irq *irq)
 {
     uint32_t bits = irq->bits;
-    irq_set_bits(irq, 0);
+    irq->bits = 0;
     sched_signal(irq_notification(irq), bits);
 }
 
