tests/mutants/fire-leaves-line-unmasked.patch
An interrupt that fires leaves its line unmasked.
The controller would forward the level again at once,
to an Irq that has disarmed and has nothing to signal;
the controller forwards a line exactly while an Irq is armed on it.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: controller forwards a line nothing is armed on

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -160,7 +160,6 @@ bool sched_interrupt(uint32_t line)
      * Masked before it signals and disarmed as it does,
      * so the driver hears once and the level may stay high until it has looked.
      */
-    irq_enable(line, false);
     irq_signal(irq);
     return true;
 }
