tests/mutants/forget-pool-walks-every-object.patch
A pool that goes looks for its newest object among every object of every pool,
still claiming each step takes one away,
so a destroy costs what the machine holds, not what it destroys.
It forgets and zeroes the same objects, so only the counting harness catches it.

Caught-by: fuzz-work
Report: a call took N paid steps in object and took away N

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -105,6 +105,9 @@ bool pool_destroy(struct pool *pool, struct cap *keep, bool preempt)
     while (pool->last != pool_base(pool)) {
         LOOP_PAID(pool_destroy, object, "an object of the pool, newest first");
         struct obj_header *o = p2v(pool->last);
+        for (struct obj_header *w = object_first(); w != NULL && w != o; w = object_next(w)) {
+            LOOP_PAID(pool_destroy, object, "an object of the pool, newest first");
+        }
         struct cap *n;
         while ((n = held_node(o, &pool->sweep)) != NULL) {
             LOOP_PAID(pool_destroy, node, "a node the object holds");
