tests/mutants/forget-pool-walks-every-object.patch
A pool that goes looks for its objects past its own, among every object of the pools older than it,
still claiming each step takes one away,
so a destroy costs what the machine holds, not what it destroys.
It forgets and zeroes the same objects, so only the counting harness catches it.

Caught-by: fuzz-work
Report: a call took N paid steps in object and took away N

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -47,7 +47,10 @@ static void pool_clear(struct pool *pool)
 {
     for (struct obj_header *o = pool_first(pool), *next; o != NULL; o = next) {
         LOOP_PAID(pool_clear, object, "an object of the pool that goes");
-        next = pool_next(pool, o);
+        next = object_next(o);
+        if (o->pool != pool->base) {
+            continue;
+        }
         sched_forget(o);
         CALL_BOUND(OBJ_MAX_SIZE);
         memset(o, 0, obj_size(o));
