tests/mutants/install-forgets-index.patch
An installed region does not record its slot.
Uninstalling it would rebuild the PMP image of whatever lies before the process;
an installed region knows its slot.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: installed region does not know its slot

diff --git a/kernel/process.c b/kernel/process.c
--- a/kernel/process.c
+++ b/kernel/process.c
@@ -72,3 +72,3 @@
     proc->slots[slot] = (struct cap){
-        .type = CAP_INSTALLED, .rights = rights, .index = (uint8_t)slot, .a = base, .b = size,
+        .type = CAP_INSTALLED, .rights = rights, .a = base, .b = size,
     };
