tests/mutants/log-append-forgets-line.patch
A byte appended to the log does not raise its line.
A reader armed on the line, which was low, never hears of the byte;
an Irq armed on the log's line has nothing untaken behind it.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: armed log irq while the log has bytes untaken

diff --git a/kernel/klog.c b/kernel/klog.c
--- a/kernel/klog.c
+++ b/kernel/klog.c
@@ -49,17 +49,7 @@ void klog_append(char c)
     bool quiet = !klog_pending();
     ring[header->head % KLOG_SIZE] = (uint8_t)c;
     header->head++;
-    if (quiet) {
-        struct irq *irq = line_binding(LOG_IRQ_LINE);
-        /*
-         * The line is high and an Irq is armed on it: it hears once and is disarmed,
-         * exactly as sched_interrupt treats a device's line.
-         * There is no controller to mask; disarmed is masked.
-         */
-        if (irq != NULL && irq_armed(irq)) {
-            irq_signal(irq);
-        }
-    }
+    (void)quiet;
 }
 
 void klog_set(struct irq *irq)
