tests/mutants/log-set-ignores-level.patch
Arming the log's Irq ignores the level of the line.
A reader that arms it with bytes untaken sleeps until the kernel prints again,
though the line is high;
an Irq armed on the log's line has nothing untaken behind it.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: armed log irq while the log has bytes untaken

diff --git a/kernel/klog.c b/kernel/klog.c
--- a/kernel/klog.c
+++ b/kernel/klog.c
@@ -66,6 +66,3 @@
 {
-    /* The line is level: arming it while it is high is hearing it now. */
-    if (irq_armed(irq) && klog_pending()) {
-        irq_signal(irq);
-    }
+    (void)irq;
 }
