tests/mutants/resume-forgets-queue.patch
A resumed thread is made ready but not put on the run queue.
It would never get the processor;
every ready thread but the running one is on the run queue.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: a waiting or ready thread is on no queue

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -391,7 +391,7 @@ static int op_thread(const struct cap *cap, uint32_t op, const uint32_t *arg)
         if (target->state != THREAD_STOPPED) {
             return KERR_STATE;
         }
-        sched_ready(target);
+        target->state = THREAD_READY;
         return KERR_OK;
     default:
         return KERR_WRONG_TYPE;
