tests/mutants/revoke-keeps-mapping.patch
A revoke that empties an installed region's slot without rebuilding the PMP image
leaves the process able to reach memory no slot grants.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: PMP image grants rights the slots do not

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -132,7 +132,7 @@ int cap_store_beside(struct captable *table, uint32_t slot, const struct cap *ca
 /* Empty a node the tree no longer names. An installed region is unmapped as well, and a thread's share unbound. */
 static void clear_node(struct cap *n)
 {
-    if (n->type == CAP_INSTALLED) {
+    if (n->type == CAP_INSTALLED && 0) {
         process_drop(n);
     } else if (n->type == CAP_BOUND) {
         sched_unbind(n);
