tests/mutants/revoke-stops-before-its-step.patch
A revoke that asks for an interrupt before its first step
may stop having taken nothing away,
and the call it stops starts again from where it began, as often as an interrupt is pending.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: a call was preempted before it took anything away

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -199,6 +199,9 @@ bool cap_revoke_below(struct cap *root, bool preempt)
      */
     while (root->child != 0) {
         LOOP_PAID(cap_revoke_below, node, "a node it clears");
+        if (cap_stop_here(preempt)) {
+            return false;
+        }
         struct cap *n = node(root->child);
         if (n->type == CAP_RETYPED) {
             if (!pool_destroy(node_pool(n), NULL, preempt)) {
