tests/mutants/revoke-stops-mid-step.patch
A revoke that stops between taking a node out of the ring and clearing it
leaves a filled slot no ring holds, whose links lead into the tree.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: parent's ring does not reach the slot

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -204,6 +204,9 @@ bool cap_revoke_below(struct cap *root, bool preempt)
             }
         } else {
             detach(n, true);
+            if (root->child != 0 && cap_stop_here(preempt)) {
+                return false;
+            }
             clear_node(n);
         }
         if (root->child != 0 && cap_stop_here(preempt)) {
