tests/mutants/set-forgets-current-tick.patch
OP_IRQ_SET on a timer line forgets the tick the call landed in:
a delay of zero arms the line for the tick already counted.
The tick fires every due timer line,
so an Irq armed on one has its deadline ahead of the count.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: armed timer line is due

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -515,7 +515,7 @@ static int op_irq(const struct cap *cap, uint32_t op, const uint32_t *arg)
          * which is exact while a delay stays far below half the count's range.
          */
         uint32_t us = arg[2];
-        irq->deadline = sched_ticks + us / TIMER_US_PER_TICK + (us % TIMER_US_PER_TICK != 0) + 1;
+        irq->deadline = sched_ticks + us / TIMER_US_PER_TICK + (us % TIMER_US_PER_TICK != 0);
     }
     /* Armed and unmasked are one state, here and in sched_interrupt. */
     irq_set_bits(irq, arg[1]);
