tests/mutants/set-forgets-current-tick.patch
OP_IRQ_SET on a timer line forgets the tick the call landed in:
a delay of zero arms the line for the tick already counted.
The tick fires every due timer line,
so an Irq armed on one has its deadline ahead of the count.
The demo times its sleeps on the clock, which now keeps pace with the tick, and finds them short.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: armed timer line is due

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -580,7 +580,7 @@ static int op_irq(const struct cap *cap, uint32_t op, uint32_t *arg)
              * The count wraps and irq_due compares with a signed difference,
              * which is exact while a delay stays far below half the count's range.
              */
-            irq->deadline = sched_ticks + ticks + 1;
+            irq->deadline = sched_ticks + ticks;
         }
     }
     /* Armed and unmasked are one state, here and in sched_interrupt. */
