tests/mutants/splice-forgets-successor.patch
A copy, or a delete's children, put after a slot
without the successor's predecessor moving to the last of them
leaves that link on a node whose next is no longer the successor.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: predecessor's next is not the slot

diff --git a/kernel/cap.c b/kernel/cap.c
--- a/kernel/cap.c
+++ b/kernel/cap.c
@@ -91,7 +91,6 @@ void cap_attach(struct cap *parent, struct cap *n)
 /* Put the siblings first to last right after beside, which has a parent, in its ring. */
 static void splice_after(struct cap *beside, struct cap *first, struct cap *last)
 {
-    ring_next(beside)->prev = v2p(last);
     last->next = beside->next;
     first->prev = v2p(beside);
     beside->next = v2p(first);
