tests/mutants/tick-leaves-due-timer.patch
A timer line that fires stays armed.
It would signal again on every later tick;
after a tick no Irq armed on a timer line is due.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: armed timer line is due

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -144,7 +144,7 @@ static void tick_advance(void)
         LOOP_BOUND(TIMER_LINES);
         struct irq *irq = line_binding(IRQ_LINES + i);
         if (irq != NULL && irq_armed(irq) && irq_due(irq, sched_ticks)) {
-            irq_signal(irq);
+            sched_signal(irq_notification(irq), irq->bits);
         }
     }
 }
