tests/mutants/to-pool-records-every-right.patch
A pool records every right instead of the region's,
so a destroy gives the memory back wider than it was lent.
The region comes back below the one the pool was made of, which may hold every right,
so the tree stays well formed; the pool itself is covered by nothing its caller held.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: a call made a pool of memory its caller held no region to

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -151,3 +151,3 @@ static int op_region(struct thread *t, uint32_t slot, const struct cap *cap,
         /* The new pool hangs below the caller's own, and dies with it. */
-        struct pool *pool = pool_create(base, size, cap->rights, obj_pool(&t->hdr));
+        struct pool *pool = pool_create(base, size, RIGHT_ALL, obj_pool(&t->hdr));
         struct cap pc = cap_to_object(&pool->hdr, RIGHT_ALL);
