tests/mutants/to-pool-zeroes-only-descriptor.patch
OP_REGION_TO_POOL zeroes only the pool's descriptor,
so objects are later allocated over whatever the process left in the memory,
and a table it filled beforehand hands it the capabilities it wrote.
Memory crosses zeroed, and the host's RAM starts out holding a pattern.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: memory became a pool with bytes not zeroed

diff --git a/kernel/syscall.c b/kernel/syscall.c
--- a/kernel/syscall.c
+++ b/kernel/syscall.c
@@ -149,3 +149,3 @@ static int op_region(struct thread *t, uint32_t slot, const struct cap *cap,
         CALL_WALK(memset);
-        memset(p2v(base), 0, size);
+        memset(p2v(base), 0, sizeof(struct pool));
         /* The new pool hangs below the caller's own, and dies with it. */
