tests/mutants/unbind-keeps-line-table.patch
A pool destroy masks the lines of the Irqs it takes but leaves them in the line table.
The next interrupt or bind on the line would find memory that is no longer an Irq;
the line table records exactly the Irqs that are bound.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: line table names an irq that is gone

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -233,7 +233,6 @@ bool sched_forget(struct obj_header *o, bool preempt)
         if (line_on_controller(line)) {
             irq_enable(line, false);
         }
-        line_irq[line] = 0;
         break;
     }
     default:
