tests/mutants/unlink-forgets-survivor.patch
A destroy that drops from the list the pools that stay before the first one it takes.
They escape every later sweep and overlap check.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work test qemu-replay
Report: dangling object capability

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -80,7 +80,6 @@ void pool_destroy(struct pool *pool)
         LOOP_WALK(pool_destroy);
         next = pool_next_pool(p);
         if (!pool_under(p, pool)) {
-            kept = p;
             continue;
         }
         /* Nothing below may fail: the pool is going. */
