tests/mutants/unlink-forgets-survivor.patch
A destroy that unlinks its pool from the list
leaves the next pool's back link naming the pool that went.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: pool list is not linked back

diff --git a/kernel/pool.c b/kernel/pool.c
--- a/kernel/pool.c
+++ b/kernel/pool.c
@@ -41,9 +41,6 @@ static void pool_unlink(struct pool *pool)
     } else {
         pool_list = pool_next_pool(pool);
     }
-    if (pool->next != 0) {
-        ((struct pool *)p2v(pool->next))->prev = pool->prev;
-    }
 }
 
 /*
