tests/mutants/wake-keeps-waiting-on.patch
A thread woken from a notification keeps naming it.
Only a waiting thread names a notification;
a ready one that still does breaks the thread-state invariant.

Caught-by: fuzz fuzz-pmp8 fuzz-grain32 fuzz-work qemu-replay
Report: runnable thread waits on something

diff --git a/kernel/sched.c b/kernel/sched.c
--- a/kernel/sched.c
+++ b/kernel/sched.c
@@ -79,7 +79,6 @@ void sched_wait(struct thread *t, struct notification *ntfn)
 static void unwait(struct thread *t)
 {
     ring_remove(&((struct notification *)p2v(t->waiting_on))->waiters, t);
-    t->waiting_on = 0;
 }
 
 void sched_ready(struct thread *t)
